{
  "members": [
    {
      "id": 1,
      "name": "John Doe",
      "role": "PhD Student",
      "school": "Stanford University",
      "research": "Natural Language Processing",
      "website": "https://johndoe.com",
      "bio": "John Doe is a PhD candidate at Stanford University, specializing in Natural Language Processing. His research focuses on developing novel approaches to machine translation and language understanding. He has published several papers in top-tier conferences including ACL and EMNLP. Prior to his PhD, he worked as a research intern at Google AI."
    },
    {
      "id": 2,
      "name": "Jane Smith",
      "role": "Postdoctoral Researcher",
      "school": "MIT",
      "research": "Computer Vision",
      "website": "https://janesmith.com",
      "bio": "Jane Smith is a Postdoctoral Researcher at MIT's Computer Science and Artificial Intelligence Laboratory. Her work focuses on computer vision, particularly in the areas of object detection and scene understanding. She received her PhD from UC Berkeley and has won several awards for her research contributions in computer vision."
    },
    {
      "id": 3,
      "name": "Alice Johnson",
      "role": "PhD Student",
      "school": "UC Berkeley",
      "research": "Machine Learning",
      "website": "https://alicejohnson.com",
      "bio": "Alice Johnson is pursuing her PhD in Machine Learning at UC Berkeley. Her research interests include deep learning, reinforcement learning, and their applications in robotics. She has developed several novel algorithms for robotic control and has presented her work at NeurIPS and ICML."
    },
    {
      "id": 4,
      "name": "Bob Wilson",
      "role": "Assistant Professor",
      "school": "Carnegie Mellon University",
      "research": "Robotics",
      "website": "https://bobwilson.com",
      "bio": "Bob Wilson is an Assistant Professor in the Robotics Institute at Carnegie Mellon University. His research focuses on developing autonomous systems that can learn from human demonstrations and adapt to new environments. He has led several projects in human-robot collaboration and has received multiple NSF grants for his work."
    },
    {
      "id": 5,
      "name": "Carol Davis",
      "role": "PhD Student",
      "school": "University of Washington",
      "research": "Human-Computer Interaction",
      "website": "https://caroldavis.com",
      "bio": "Carol Davis is a PhD candidate in Human-Computer Interaction at the University of Washington. Her research explores how AI can enhance human creativity and productivity. She has developed several tools for creative professionals and has published her work at CHI and UIST conferences."
    },
    {
      "id": 6,
      "name": "David Lee",
      "role": "Postdoctoral Researcher",
      "school": "University of Toronto",
      "research": "Computer Graphics",
      "website": "https://davidlee.com",
      "bio": "David Lee is a Postdoctoral Researcher at the University of Toronto, specializing in computer graphics and visualization. His work focuses on real-time rendering techniques and physically-based animation. He has contributed to several open-source graphics projects and has published in SIGGRAPH and Eurographics."
    },
    {
      "id": 7,
      "name": "Emma Brown",
      "role": "PhD Student",
      "school": "Harvard University",
      "research": "Computational Biology",
      "website": "https://emmabrown.com",
      "bio": "Emma Brown is a PhD student in Computational Biology at Harvard University. Her research combines machine learning with biological data analysis to understand complex biological systems. She has developed novel algorithms for protein structure prediction and has published in Nature Methods and Bioinformatics."
    },
    {
      "id": 8,
      "name": "Frank Miller",
      "role": "Associate Professor",
      "school": "University of Illinois",
      "research": "Computer Architecture",
      "website": "https://frankmiller.com",
      "bio": "Frank Miller is an Associate Professor of Computer Science at the University of Illinois. His research focuses on computer architecture, particularly in the areas of memory systems and parallel computing. He has received several awards for his contributions to computer architecture and has served on numerous program committees."
    },
    {
      "id": 9,
      "name": "Grace Taylor",
      "role": "PhD Student",
      "school": "Princeton University",
      "research": "Theoretical Computer Science",
      "website": "https://gracetaylor.com",
      "bio": "Grace Taylor is a PhD candidate in Theoretical Computer Science at Princeton University. Her research focuses on algorithms and complexity theory, with particular interest in approximation algorithms and online algorithms. She has published in STOC and FOCS and has received several fellowships for her research."
    },
    {
      "id": 10,
      "name": "Henry Clark",
      "role": "Postdoctoral Researcher",
      "school": "Yale University",
      "research": "Quantum Computing",
      "website": "https://henryclark.com",
      "bio": "Henry Clark is a Postdoctoral Researcher in Quantum Computing at Yale University. His work focuses on developing quantum algorithms and error correction techniques. He has contributed to several breakthroughs in quantum computing and has published in Nature and Physical Review Letters."
    }
  ]
} 